app/Controllers/Login.php

    public function Login(){
        $session = session();
        $userModel = new UsuarioModel();
        $data = $userModel->where('email', $this->request->getVar('EMAIL'))->first();
---
SELECT *
FROM `usuario`
WHERE `email` = 'kauabastos2003@gmail.com'
 LIMIT 1