app/Controllers/Produtos.php

SELECT *
FROM `produto`
ORDER BY `id`
---
    public function index()
    {
        $produtoModel = new ProdutoModel();
        $data['produtos'] = $produtoModel->orderBy('id')->findAll();

INSERT INTO `produto` (`nome`, `valor`) VALUES ('teste 2', '3')
---
    public function CadastrarProduto(){
        $produtoModel  = new ProdutoModel();
        $data = [
            'nome'       => $this->request->getVar('Nome'),
            'valor'      => $this->request->getVar('Valor')
        ];
        return $produtoModel->insert($data);

SELECT *
FROM `produto`
ORDER BY `id`
---
    public function CadastroProdutoTable()
    {
        $produtoModel = new ProdutoModel();
        return  $this->GeraTable(__FUNCTION__ ,['N°','Nome','Valor'],$produtoModel->orderBy('id')->findAll());