app/Controllers/Sobre.php

SELECT *
FROM `sobre`
ORDER BY `id`
---
    public function index()
    {
        $sobreModel = new SobreModel();
        $data['sobre'] = $sobreModel->orderBy('id')->findAll();