app/Controllers/Usuario.php

SELECT *
FROM `usuario`
ORDER BY `id`
---
    public function TableUsuario()
    {
        $usuarioModel = new UsuarioModel();
        return $this->GeraTable(__FUNCTION__ ,['N°','Nome','Categoria','Email','Senha'],$usuarioModel->orderBy('id')->findAll());